<?php include('header.php'); ?>

<main class="dpa-page-content">
    <div class="dpa-container">
        <div class="dpa-header">
            <p class="language-notice">GREEK Language Only: The database carries data only for Greek speaking people, because only Greek speaking people are enrolled in the Department. In case that a foreign student is enrolled, then he can ask for a translation to English. This site is GPDR compliant.</p>
            <h1>ΔΗΛΩΣΗ ΠΡΟΣΤΑΣΙΑΣ ΠΡΟΣΩΠΙΚΩΝ ΔΕΔΟΜΕΝΩΝ - ΠΟΛΙΤΙΚΗ ΑΣΦΑΛΕΙΑΣ ΚΑΙ ΑΠΟΡΡΗΤΟΥ</h1>
            <h2>Πολιτική απορρήτου & συμμόρφωση GDPR</h2>
        </div>

        <section class="dpa-section">
            <p>Η παρούσα δήλωση αφορά όλα τα website που φιλοξενούνται στον διακομιστή arch.ece.uowm.gr. Ο διακομιστής διαχειρίζεται από τον Μηνά Δασυγένη και τα δεδομένα συλλέγονται για την καλύτερη λειτουργία μαθημάτων, εκπαιδευτικών εργασιών ή προγραμμάτων στα οποία συμμετέχει. Δεν ανήκει σε κάποια εταιρία. Πρόσβαση σε κάποια δεδομένα έχουν αυτοί που έχουν νόμιμο δικαίωμα επεξεργασίας, όπως στην Πρακτική Άσκηση η γραμματειακή υποστήριξη.</p>
            <p>Η χρήση των ηλεκτρονικών σελίδων και υπηρεσιών πού παρέχονται στον επισκέπτη/χρήστη, από τον ιστότοπο arch.ece.uowm.gr και τους ιστοχώρους που φιλοξενούνται σε αυτό, προϋποθέτει την ανεπιφύλακτη συμφωνία σας με την Πολιτική Απορρήτου περί Προστασίας Προσωπικών Δεδομένων του παρόντος ιστότοπου. Συνεπώς, ο επισκέπτης/χρήστης οφείλει να διαβάσει προσεκτικά τα περιεχόμενα αυτής της σελίδας, πριν από τη χρήση των υπηρεσιών του διαδικτυακού μας τόπου. Aν δεν συμφωνεί, θα πρέπει να τον εγκαταλείψει και να ΜΗΝ κάνει καμία χρήση των υπηρεσιών και του περιεχομένου του. Αυτή η πολιτική απορρήτου μπορεί να αλλάζει από καιρό σε καιρό σύμφωνα με τη νομοθεσία ή τις εξελίξεις στον κλάδο. Δεν θα ενημερώσουμε ρητά τους πελάτες μας ή τους χρήστες του ιστότοπου μας για τις αλλαγές αυτές. Αντ̓ αυτού, σας συνιστούμε να ελέγχετε περιστασιακά αυτή τη σελίδα για τυχόν αλλαγές της παρούσας πολιτικής απορρήτου. Η εξακολούθηση της χρήσης του ιστότοπου sasashop.gr ακόμη και μετά τις όποιες αλλαγές στην Πολιτική Απορρήτου, σημαίνει την ανεπιφύλακτη αποδοχή των όρων αυτών εκ μέρους σας.</p>
            <p>Η εγγραφή στις υπηρεσίες του ιστοχώρου είναι προαιρετική, γίνεται από το χρήστη ή σε ελάχιστες περιπτώσεις από το διαχειριστή, αν έχει δεχθεί να συμμετέχει σε κάποιο πρόγραμμα που απαιτείται η εγγραφή του, όπως για παράδειγμα το πρόγραμμα της πρακτικής άσκησης.</p>
            <p>Προκειμένου να χρησιμοποιήσετε τον ιστοχώρο θα πρέπει να δώσετε τα παρακάτω στοιχεία: όνομα χρήστη, κωδικό, email. Επίσης, μπορείτε να τοποθετήσετε και το τηλέφωνο ή τη διεύθυνσή σας. Αυτά είναι τα μόνα προσωπικά δεδομένα που διαφυλλάσονται στο site και με τη χρήση του δίνετε τη συγκατάθεση αποθήκευσης, επεξεργασίας και διαχείρισης. Ο διδάσκων σέβεται το προσωπικό απόρρητο κάθε χρήστη της Ιστοσελίδας.</p>
            <p>Η καταχώριση των στοιχείων του χρήστη κατά την εγγραφή του στην ιστοσελίδα για την παροχή υπηρεσιών μέσω αυτής, συνεπάγεται τη συναίνεσή του στη συλλογή, χρήση και διαβίβαση των προσωπικών του στοιχείων βάσει των όρων της παρούσας πολιτικής προστασίας απορρήτου προσωπικών δεδομένων.</p>
            <p>Αυτό το κείμενο αποτελεί γνωστοποίηση στο χρήστη σύμφωνα με το άρθρο 5 του ν. 2472/1997 περί προστασίας προσωπικών δεδομένων.</p>
        </section>

        <section class="dpa-section">
            <h3>Data Collection and Security</h3>
            <p>Συλλέγουμε και επεξεργαζόμαστε τα προσωπικά σας δεδομένα, μόνο όταν είναι απολύτως απαραίτητο. Δεν πρόκειται ποτέ να πουλήσουμε, να ενοικιάσουμε, να διανείμουμε, ή να δημοσιοποιήσουμε με οποιονδήποτε τρόπο, τα προσωπικά σας δεδομένα. Τα προσωπικά δεδομένα είναι ασφαλισμένα και κρυπτογραφημένα στη βάση δεδομένων, και δεν είναι προσβάσιμα δημόσια ή ιδιωτικά, ούτε ανακοινώνονται σε τρίτους. Μόνο ο διδάσκων Μ. Δασυγένης έχει πρόσβαση σε όλο το αρχείο της βάσης δεδομένων. Υπάρχει η δυνατότητα να έρθει ένας χρήστης στο γραφείο μου ή να επικοινωνήσει μαζί μου τηλεφωνικά στο 2461056534 για να δει τα δεδομένα που φυλλάσονται για τον ίδιο (δικαίωμα ενημέρωσης και δικαίωμα πρόσβασης). Τέλος, ο μόνος τρόπος πρόσβασης στο arch.ece.uowm.gr είναι μέσω ασφαλούς σύνδεσης https, διαφυλάσσοντας την εμπιστευτικότητα και την ακεραιότητα των δεδομένων, ενώ η φυσική προσπέλαση του μηχανήματος δεν είναι εφικτή αφού βρίσκεται στο VIMA VPS. Επίσης, ο διαχειριστής έχει τοποθετήσει πάρα πολλά μέτρα προστασίας για hacking, π.χ. fail2ban ώστε να κόβεται με firewall η IP όταν γίνονται 5 ή παραπάνω λάθος προσπάθεις σύνδεσης, phpban, ώστε σε περίπτωση που κάποιος κάνει bruteforcing/enumeration σε php σελίδες, να κοβεται με firewall, πλήρης καταγραφή και ανάλυση των προσπάθειων με IDS για τις προσβάσεις με php, συνεχής ανάλυση των εκτελούμενων διεργασιών ώστε να ανιχνευθεί αν έχει ξεκινήσει μια νέα μη αυθεντικοποιημένη διεργασία, backup, VPN, συνδεδεμένο firewall με άλλους διακομιστές, ώστε να ανταλλάσουν τις λίστες με τις διευθύνσεις IP που πρέπει να γίνουν ban και άλλα.</p>
        </section>
        
        <section class="dpa-section">
            <h3>Cookies</h3>
            <p>Ο όρος «cookie» αναφέρεται σε ένα μικρό αρχείο δεδομένων που αποτελείται αποκλειστικά από μια σειρά πληροφοριών σε μορφή κειμένου, το οποίο ο ιστότοπος μεταφέρει στο πρόγραμμα πλοήγησης ιστού που βρίσκεται στο σκληρό δίσκο του υπολογιστή σας, είτε προσωρινά καθ’ όλη τη διάρκεια της επίσκεψής σας, είτε μερικές φορές για μεγαλύτερες περιόδους, ανάλογα με τον τύπο του cookie. Τα cookies εκτελούν διάφορες λειτουργίες (για παράδειγμα, σας ξεχωρίζουν από τους άλλους επισκέπτες του ίδιου ιστοτόπου ή θυμούνται ορισμένα πράγματα για εσάς, όπως τις προτιμήσεις σας) και χρησιμοποιούνται από τους περισσότερους ιστότοπους για να βελτιώσουν την εμπειρία σας ως χρήστη τους. Κάθε cookie είναι μοναδικό για το πρόγραμμα πλοήγησής σας και περιέχει ορισμένες ανώνυμες πληροφορίες. Ένα cookie συνήθως περιέχει το όνομα του πεδίου από όπου προήλθε το cookie, τη «διάρκεια ζωής» του cookie καθώς και μία τιμή (συνήθως με τη μορφή ενός τυχαίως παραχθέντα μοναδικού αριθμού). Τα cookies που στέλνει το arch είναι:</p>
            <ul>
                <li><strong>Cookies επίσκεψης (session cookies):</strong> Πρόκειται για προσωρινά cookies που παραμένουν στο αρχείο των cookies του προγράμματος πλοήγησης της συσκευής σας μόνο κατά τη διάρκεια της επίσκεψής σας και διαγράφονται όταν κλείσετε το πρόγραμμα πλοήγησης.</li>
                <li><strong>Μόνιμα cookies (persistent cookies):</strong> Αν επιλέξετε το "Να με θυμάσαι/Remember me" αποθηκεύουν το όνομα χρήστη και τον κωδικό σας και έτσι όταν κλείσετε το browser και τον ανοίξετε αυτόματα θα γίνει σύνδεση στο arch. Αν πατήσετε logout, σβήνονται αυτά τα cookies</li>
                <li><strong>Cookies της Google Analytics:</strong> Τα cookies της υπηρεσίας Google Analytics είναι cookies ανάλυσης/καταγραφής απόδοσης που μας επιτρέπουν να συλλέγουμε ανώνυμες πληροφορίες για το πώς οι επισκέπτες χρησιμοποιούν τον ιστότοπό μας. Αυτά τα cookies μπορούν να μας ενημερώνουν σχετικά με το πόσοι επισκέπτες χρησιμοποιούν τον ιστότοπο, την ώρα και τη διάρκεια της πρόσβασης, ενώ επίσης παρέχουν πληροφορίες για τον τρόπο πλοήγησης των επισκεπτών στα διάφορα σημεία του ιστοτόπου. Αυτές οι πληροφορίες μας βοηθούν να βελτιώσουμε τον τρόπο με τον οποίο λειτουργεί ο ιστότοπός μας. Είναι ανώνυμες πληροφορίες και δεν περιέχουν προσωπικά δεδομένα. Οι πληροφορίες που συλλέγονται από τα cookies της Google Analytics σχετικά με τον ιστοτόπό μας μεταφέρονται και αποθηκεύονται στους διακομιστές της Google σύμφωνα με την πολιτική απορρήτου της Google. Για περισσότερες πληροφορίες αναφορικά με την υπηρεσία Google Analytics, παρακαλούμε κάντε κλικ στο <a href="https://support.google.com/analytics/answer/6004245" target="_blank">https://support.google.com/analytics/answer/6004245</a>. Μπορείτε να απενεργοποιήσετε την παρακολούθηση από την υπηρεσία Google Analytics κάνοντας κλικ στο <a href="https://tools.google.com/dlpage/gaoptout?hl=en=GB" target="_blank">https://tools.google.com/dlpage/gaoptout?hl=en=GB</a>. Αν απενεργοποιήσετε αυτά τα cookies η χρήση του ιστοτόπου από εσάς δεν θα καταμετρείται, ούτε θα χρησιμοποιείται στα στατιστικά στοιχεία που συλλέγουμε για να βελτιώσουμε τις υπηρεσίες που παρέχουμε μέσω του ιστοτόπου. Η λειτουργία του ιστοτόπου δεν θα επηρεαστεί.</li>
            </ul>
        </section>

        <section class="dpa-section">
            <h3>Compliance with Regulations</h3>
            <p>Παράλληλα με τα εσωτερικά συστήματα πληροφορικής της εταιρείας μας, ο ιστότοπος αυτός έχει σχεδιαστεί έτσι ώστε να συμμορφώνεται όσον αφορά την προστασία των προσωπικών δεδομένων των χρηστών, με τις νομοθεσίες/κανονισμούς που ακολουθούν:</p>
            <ol>
                <li>Οδηγία της ΕΕ για την προστασία των δεδομένων του 1995 (DPD) <a href="https://eur-lex.europa.eu/legal-content/EL/ALL/?uri=celex%3A31995L0046" target="_blank">https://eur-lex.europa.eu/legal-content/EL/ALL/?uri=celex%3A31995L0046</a></li>
                <li>Κανονισμός 2018 για την γενική προστασία δεδομένων της ΕΕ (GDPR) <a href="https://eur-lex.europa.eu/legal-content/EL/TXT/HTML/?uri=CELEX:32016R0679&from=EL" target="_blank">https://eur-lex.europa.eu/legal-content/EL/TXT/HTML/?uri=CELEX:32016R0679&from=EL</a></li>
            </ol>
        </section>

        <section class="dpa-section">
            <h3>User Rights and Data Usage</h3>
            <p>Εκτός των ανωτέρω προσωπικών δεδομένων, για την καλύτερη ασφάλεια του ιστοχώρου και βαθμολογικής διαφάνειας, καταγράφεται και η IP του κάθε χρήστη και ενδεχομένως η συμπεριφορά του στο arch.ece.uowm.gr. Σας δηλώνουμε ότι:</p>
            <ul>
                <li>Τα στοιχεία σας, δεν θα δοθούν σε κανένα άλλο φορέα / επιχείρηση / οργανισμό, οπουδήποτε κι αν εδρεύει ή εκπροσωπείται.</li>
                <li>Έχετε δικαίωμα να ζητήσετε οποτεδήποτε να σας γνωστοποιηθούν τα στοιχεία που μας έχετε δώσει και να λάβετε αντίγραφό τους, με απλό έγγραφο αίτημά σας.</li>
                <li>Έχετε δικαίωμα να ζητήσετε διόρθωση των στοιχείων σας, με απλή έγγραφη γνωστοποίηση σας.</li>
                <li>Έχετε δικαίωμα να ζητήσετε περιορισμό, ή διακοπή επεξεργασίας, ή διαγραφή των στοιχείων αυτών, με απλό έγγραφο αίτημά σας. Σε περίπτωση που τα στοιχεία σας αφορούν βαθμολογίες/εργασίες/ασκήσεις και άλλα παρόμοια που εκπονήσατε ως φοιτητές στο Τμήμα, τότε αυτά δε μπορούν να διαγραφούν για λόγους ιστορικού.</li>
                <li>Τα παραπάνω μπορούν να ζητηθούν ταυτόχρονα ή σταδιακά.</li>
                <li>Τα δεδομένα φυλλάσονται για ιστορικούς λόγους και δε διαγράφονται ποτέ.</li>
            </ul>
            <p>Επίσης, όλα τα δεδομένα που φυλλάσονται στη βάση δεδομένων του arch αφορούν ΜΗ ΚΕΡΔΟΣΚΟΠΙΚΕΣ ΛΕΙΤΟΥΡΓΙΕΣ και χρησιμοποιούνται για την καλύτερη ενημέρωση των φοιτητών, και για την άρτια λειτουργία της εκπαιδευτικής διαδικασίας των καθηγητών που έχουν πρόσβαση ή των προγραμμάτων που συμμετέχει ο κ. Δασυγένης (π.χ. πρακτική άσκηση). Τέλος, τα δεδομένα που διαφυλάσονται είναι τα ελάχιστα δυνατά που απαιτούνται για την νόμιμη και κανονική υλοποίηση της εκπαιδευτικής διαδικασίας ή της προσωποιημένης πληροφόρησης ή της εκπόνησης κατάλληλων έργων. Δεν απαιτούνται καθόλου περιττά δεδομένα.</p>
        </section>
        
        <section class="dpa-section contact-info">
            <h3>Υπεύθυνος Ασφαλείας Δεδομένων και Διακομιστή</h3>
            <p>Μηνάς Δασυγένης, mdasyg at ieee dot org, +30 2461056534</p>
        </section>
    </div>
</main>

<?php include('footer.php'); ?> 